# Setup
cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/php'
tap 'homebrew/services'

# Fundamentals
brew 'zsh'
brew 'tmux'
brew 'wget'
brew 'vim'
brew 'git'
brew 'git-extras'
brew 'tree'
brew 'openssl'
brew 'htop-osx'
brew 'imagemagick'
brew 'ffmpeg'

# Node
brew 'node'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Java & Android
cask 'java'
brew 'gradle'
brew 'android-sdk'

# DBs
brew 'postgresql'
brew 'mongodb'
brew 'redis'

# Apps
cask '1password'
cask 'iterm2'
cask 'alfred'
cask 'google-chrome-canary'
cask 'sublime-text'
cask 'android-studio-canary'
cask 'cloud'
cask 'dropbox'
cask 'dash'
cask 'slack'
cask 'skype'
cask 'sequel-pro'
cask 'virtualbox'
cask 'vagrant'
cask 'spectacle'
cask 'screenhero'
cask 'istat-menus'
cask 'spamsieve'
cask 'caret'
cask 'steam'
cask 'tunnelblick'
cask 'vlc'
cask 'the-unarchiver'
cask 'spotify'
cask 'divvy'
cask 'utorrent'
