# Taps
tap 'homebrew/bundle'
tap 'homebrew/fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'

# Binaries
brew 'bat'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'fd'
brew 'ffmpeg'
brew 'fpp'
brew 'git'
brew 'git-extras'
brew 'grc'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'reattach-to-user-namespace'
brew 'thefuck'
brew 'tmux'
brew 'tokei'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'wifi-password'
brew 'z'
brew 'zsh-completions'
brew 'zsh'

# Dev
brew 'awscli'
brew 'composer'
brew 'docker'
brew 'docker-compose'
brew 'heroku'
brew 'node'
brew 'openssl'
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
brew 'vim', args: ['with-override-system-vi']
brew 'yarn', args: ['ignore-dependencies']

# Databases
brew 'mongodb', restart_service: true
brew 'mysql', restart_service: true
brew 'postgresql', restart_service: true

# Apps
cask '1password'
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'franz'
cask 'google-chrome'
cask 'grammarly'
cask 'postman'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'webtorrent'

# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-pt-sans'
cask 'font-lato'
cask 'font-raleway'
cask 'font-fira-code'
