# Install command-line tools using Homebrew
# Usage: `brew bundle Brewfile`

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "romkatv/powerlevel10k"

# -- main packages --
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# POSIX *nix fetch script using Nerdfonts
brew "nerdfetch"
# Theme for zsh
brew "powerlevel10k"

# CPU/RAM/battery stats chart bar for tmux (and GNU screen)
brew "rainbarf"
# Spoof your MAC address in macOS
brew "spoof-mac"

# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Show the current WiFi network password
brew "wifi-password"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Flexible and fast Zsh plugin manager
brew "zinit"
brew "zoxide"
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
# brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
# brew "zsh-fast-syntax-highlighting"
# brew "zsh-history-substring-search"
# brew 'zsh-completions'
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# -- develop --
# Pack, ship and run any application as a lightweight container
brew "docker"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Isolated development environments using Docker
brew "docker-compose"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Platform built on V8 to build network applications
brew "node"
# High-performance and real-time metrics displaying HTTP benchmarking tool
brew "plow"
# Fast, disk space efficient package manager
brew "pnpm"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"

# -- apps --
# Command-line interface for 1Password
cask "1password-cli"
# User-friendly GUI app for Homebrew
cask "applite"
# Collaborative team software
cask "figma"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calculator and converter application
cask "numi"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code", args: { appdir: "/Applications" }
# Multimedia player
cask "vlc"
# Alternative and privacy-friendly YouTube frontend
cask "yattee"
# Video communication and virtual meeting platform
cask "zoom"

# -- fonts --
cask "font-fira-code"
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"


# -- quick look plugins --
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look plugin for webp files
cask "webpquicklook"

# -- vscode extensions --
vscode "aaron-bond.better-comments"
vscode "andys8.jest-snippets"
vscode "artlaman.chalice-icon-theme"
vscode "astro-build.astro-vscode"
vscode "bierner.comment-tagged-templates"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cssho.vscode-svgviewer"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dkundel.vscode-new-file"
vscode "doggy8088.quicktype-refresh"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "humao.rest-client"
vscode "irongeek.vscode-env"
vscode "johnpapa.vscode-cloak"
vscode "johnpapa.vscode-peacock"
vscode "jpoissonnier.vscode-styled-components"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-codemetrics"
vscode "lehni.vscode-fix-checksums"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "nick-lvov-dev.typescript-explicit-types"
vscode "orta.vscode-twoslash"
vscode "orta.vscode-twoslash-queries"
vscode "obstinate.vesper-pp"
vscode "oven.bun-vscode"
vscode "paulmolluzzo.convert-css-in-js"
vscode "pmneo.tsimporter"
vscode "pnp.polacode"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "raunofreiberg.vesper"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sleistner.vscode-fileutils"
vscode "sryze.uridecode"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wakatime.vscode-wakatime"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
vscode "ypresto.vscode-intelli-refactor"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
